sleemanj/ATTinyCore/avr/boards.txt
attinyx41.name=ATtiny441/841 (No bootloader)
attinyx41.upload.tool=avrdude
attinyx41.bootloader.tool=avrdude
attinyx41.bootloader.unlock_bits=0xFF
attinyx41.bootloader.lock_bits=0xFF
attinyx41.bootloader.file=empty/empty_all.hex
attinyx41.build.core=tinymodern
attinyx41.build.board=AVR_ATTINYX41
attinyx41.build.export_merged_output=false
attinyx41.menu.chip.841=ATtiny841
attinyx41.menu.chip.841.build.mcu=attiny841
attinyx41.menu.chip.841.upload.maximum_size=8192
attinyx41.menu.chip.841.upload.maximum_data_size=512
attinyx41.menu.chip.441=ATtiny441
attinyx41.menu.chip.441.build.mcu=attiny441
attinyx41.menu.chip.441.upload.maximum_size=4096
attinyx41.menu.chip.441.upload.maximum_data_size=256
attinyx41.menu.LTO.enable=Enabled
attinyx41.menu.LTO.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attinyx41.menu.LTO.enable.ltoelfflags=-flto -DLTO_ENABLED -fuse-linker-plugin
attinyx41.menu.LTO.enable.ltocppflags=-flto -DLTO_ENABLED
attinyx41.menu.LTO.enable.ltoarcmd=gcc-
attinyx41.menu.LTO.disable=Disabled
attinyx41.menu.LTO.disable.ltocflags=
attinyx41.menu.LTO.disable.ltoelfflags=
attinyx41.menu.LTO.disable.ltocppflags=
attinyx41.menu.LTO.disable.ltoarcmd=
attinyx41.menu.clock.8internal=8 MHz (internal)
attinyx41.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx41.menu.clock.8internal.bootloader.ulp_bits=111
attinyx41.menu.clock.8internal.build.f_cpu=8000000L
attinyx41.menu.clock.16external=16 MHz (external)
attinyx41.menu.clock.16external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.16external.bootloader.ulp_bits=111
attinyx41.menu.clock.16external.build.f_cpu=16000000L
attinyx41.menu.clock.12external=12 MHz (external)
attinyx41.menu.clock.12external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.12external.bootloader.ulp_bits=111
attinyx41.menu.clock.12external.build.f_cpu=12000000L
attinyx41.menu.clock.8external=8 MHz (external)
attinyx41.menu.clock.8external.bootloader.low_fuses=0xED
attinyx41.menu.clock.8external.bootloader.ulp_bits=111
attinyx41.menu.clock.8external.build.f_cpu=8000000L
attinyx41.menu.clock.737external=7.372 MHz (external)
attinyx41.menu.clock.737external.bootloader.low_fuses=0xED
attinyx41.menu.clock.737external.bootloader.ulp_bits=111
attinyx41.menu.clock.737external.build.f_cpu=7372800L
attinyx41.menu.clock.92external=9.216 MHz (external)
attinyx41.menu.clock.92external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.92external.bootloader.ulp_bits=111
attinyx41.menu.clock.92external.build.f_cpu=9216000L
attinyx41.menu.clock.11external=11.0592 MHz (external)
attinyx41.menu.clock.11external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.11external.bootloader.ulp_bits=111
attinyx41.menu.clock.11external.build.f_cpu=11059200L
attinyx41.menu.clock.14external=14.7456 MHz (external)
attinyx41.menu.clock.14external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.14external.bootloader.ulp_bits=111
attinyx41.menu.clock.14external.build.f_cpu=14745600L
attinyx41.menu.clock.184external=18.432 MHz (external - overclocked)
attinyx41.menu.clock.184external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.184external.bootloader.ulp_bits=111
attinyx41.menu.clock.184external.build.f_cpu=18432000L
attinyx41.menu.clock.1internal=1 MHz (internal)
attinyx41.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx41.menu.clock.1internal.bootloader.ulp_bits=111
attinyx41.menu.clock.1internal.build.f_cpu=1000000L
attinyx41.menu.clock.20external=20 MHz (external - overclocked)
attinyx41.menu.clock.20external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.20external.bootloader.ulp_bits=111
attinyx41.menu.clock.20external.build.f_cpu=20000000L
attinyx41.menu.clock.6external=6 MHz (external)
attinyx41.menu.clock.6external.bootloader.low_fuses=0xED
attinyx41.menu.clock.6external.bootloader.ulp_bits=111
attinyx41.menu.clock.6external.build.f_cpu=6000000L
attinyx41.menu.clock.4external=4 MHz (external)
attinyx41.menu.clock.4external.bootloader.low_fuses=0xED
attinyx41.menu.clock.4external.bootloader.ulp_bits=111
attinyx41.menu.clock.4external.build.f_cpu=4000000L
attinyx41.menu.clock.512internal=512 kHz (internal ULP)
attinyx41.menu.clock.512internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.512internal.bootloader.ulp_bits=011
attinyx41.menu.clock.512internal.build.f_cpu=512000L
attinyx41.menu.clock.256internal=256 kHz (internal ULP)
attinyx41.menu.clock.256internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.256internal.bootloader.ulp_bits=100
attinyx41.menu.clock.256internal.build.f_cpu=256000L
attinyx41.menu.clock.128internal=128 kHz (internal ULP)
attinyx41.menu.clock.128internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.128internal.bootloader.ulp_bits=101
attinyx41.menu.clock.128internal.build.f_cpu=128000L
attinyx41.menu.clock.64internal=64 kHz (internal ULP)
attinyx41.menu.clock.64internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.64internal.bootloader.ulp_bits=110
attinyx41.menu.clock.64internal.build.f_cpu=64000L
attinyx41.menu.clock.32internal=32 kHz (internal ULP)
attinyx41.menu.clock.32internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.32internal.bootloader.ulp_bits=111
attinyx41.menu.clock.32internal.build.f_cpu=32000L
attinyx41.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx41.bootloader.extended_fuses=0b{bootloader.ulp_bits}{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attinyx41.menu.eesave.aenable=EEPROM retained
attinyx41.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx41.menu.eesave.disable=EEPROM not retained
attinyx41.menu.eesave.disable.bootloader.eesave_bit=1
attinyx41.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx41.menu.bod.1v8.bootloader.bod_bits=110
attinyx41.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx41.menu.bod.2v7.bootloader.bod_bits=101
attinyx41.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx41.menu.bod.4v3.bootloader.bod_bits=100
attinyx41.menu.bodact.disabled=B.O.D. Disabled
attinyx41.menu.bodact.disabled.bootloader.bodact_bits=11
attinyx41.menu.bodact.enabled=B.O.D. Enabled
attinyx41.menu.bodact.enabled.bootloader.bodact_bits=10
attinyx41.menu.bodact.sampled=B.O.D. Sampled Mode
attinyx41.menu.bodact.sampled.bootloader.bodact_bits=01
attinyx41.menu.bodpd.disabled=B.O.D. Disabled
attinyx41.menu.bodpd.disabled.bootloader.bodpd_bits=11
attinyx41.menu.bodpd.enabled=B.O.D. Enabled
attinyx41.menu.bodpd.enabled.bootloader.bodpd_bits=10
attinyx41.menu.bodpd.sampled=B.O.D. Sampled Mode
attinyx41.menu.bodpd.sampled.bootloader.bodpd_bits=01
attinyx41.build.extra_flags={build.pinmap} {build.wiremode}
attinyx41.menu.pinmapping.anew=Clockwise (like Rev. D boards)
attinyx41.menu.pinmapping.anew.build.pinmap=-DNEW_PINOUT
attinyx41.menu.pinmapping.old=Counterclockwise (like old ATTinyCore and Rev. C boards)
attinyx41.menu.pinmapping.old.build.pinmap=-DOLD_PINOUT
attinyx41.menu.wiremode.amaster=Master Only
attinyx41.menu.wiremode.amaster.build.wiremode=-DWIRE_MASTER_ONLY
attinyx41.menu.wiremode.slave=Slave Only
attinyx41.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attinyx41.menu.wiremode.both=Both (uses more flash)
attinyx41.menu.wiremode.both.build.wiremode=-DWIRE_BOTH

attinyx41opti.name=ATtiny441/841 (Optiboot)
attinyx41opti.upload.protocol=arduino
attinyx41opti.upload.maximum_size=7552
attinyx41opti.upload.maximum_data_size=512
attinyx41opti.upload.tool=avrdude
attinyx41opti.bootloader.tool=avrdude
attinyx41opti.bootloader.unlock_bits=0xFF
attinyx41opti.bootloader.lock_bits=0xFF
attinyx41opti.menu.bootUART.UART0=UART0 (Serial)
attinyx41opti.menu.bootUART.UART0.bootloader.postfix=
attinyx41opti.menu.bootUART.UART1=UART1 (Serial1)
attinyx41opti.menu.bootUART.UART1.bootloader.postfix=_ser1
attinyx41opti.menu.chip.841=ATtiny841
attinyx41opti.menu.chip.841.build.mcu=attiny841
attinyx41opti.menu.chip.841.upload.maximum_size=7552
attinyx41opti.menu.chip.841.upload.maximum_data_size=512
attinyx41opti.menu.chip.441=ATtiny441
attinyx41opti.menu.chip.441.build.mcu=attiny441
attinyx41opti.menu.chip.441.upload.maximum_size=3456
attinyx41opti.menu.chip.441.upload.maximum_data_size=256
attinyx41opti.build.core=tinymodern
attinyx41opti.build.board=AVR_ATTINYX41
attinyx41opti.build.export_merged_output=false
attinyx41opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.postfix}.hex
attinyx41opti.bootloader.extended_fuses=0xFE
attinyx41opti.bootloader.high_fuses=0xD7
attinyx41opti.menu.LTO.enable=Enabled
attinyx41opti.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx41opti.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx41opti.menu.LTO.enable.ltocppflags=-flto
attinyx41opti.menu.LTO.enable.ltoarcmd=gcc-
attinyx41opti.menu.LTO.disable=Disabled
attinyx41opti.menu.LTO.disable.ltocflags=
attinyx41opti.menu.LTO.disable.ltoelfflags=
attinyx41opti.menu.LTO.disable.ltocppflags=
attinyx41opti.menu.LTO.disable.ltoarcmd=
attinyx41opti.menu.clock.8internal=8 MHz (internal)
attinyx41opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.8internal.build.f_cpu=8000000L
attinyx41opti.menu.clock.8internal.upload.speed=57600
attinyx41opti.menu.clock.16external=16 MHz (external)
attinyx41opti.menu.clock.16external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.16external.build.f_cpu=16000000L
attinyx41opti.menu.clock.16external.upload.speed=115200
attinyx41opti.menu.clock.12external=12 MHz (external)
attinyx41opti.menu.clock.12external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.12external.build.f_cpu=12000000L
attinyx41opti.menu.clock.12external.upload.speed=115200
attinyx41opti.menu.clock.8external=8 MHz (external)
attinyx41opti.menu.clock.8external.bootloader.low_fuses=0xED
attinyx41opti.menu.clock.8external.build.f_cpu=8000000L
attinyx41opti.menu.clock.8external.upload.speed=57600
attinyx41opti.menu.clock.8internal5v=8 MHz (internal, Vcc > 4v)
attinyx41opti.menu.clock.8internal5v.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.8internal5v.build.f_cpu=8200000L
attinyx41opti.menu.clock.8internal5v.upload.speed=57600
attinyx41opti.menu.clock.737external=7.3728 MHz (external)
attinyx41opti.menu.clock.737external.bootloader.low_fuses=0xED
attinyx41opti.menu.clock.737external.build.f_cpu=7372800L
attinyx41opti.menu.clock.737external.upload.speed=57600
attinyx41opti.menu.clock.921external=9.216 MHz (external)
attinyx41opti.menu.clock.921external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.921external.build.f_cpu=9216000L
attinyx41opti.menu.clock.921external.upload.speed=57600
attinyx41opti.menu.clock.110external=11.0592 MHz (external)
attinyx41opti.menu.clock.110external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.110external.build.f_cpu=11059200L
attinyx41opti.menu.clock.110external.upload.speed=115200
attinyx41opti.menu.clock.147external=14.7456 MHz (external)
attinyx41opti.menu.clock.147external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.147external.build.f_cpu=14745600L
attinyx41opti.menu.clock.147external.upload.speed=115200
attinyx41opti.menu.clock.184external=18.432 MHz (external - overclocked)
attinyx41opti.menu.clock.184external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.184external.build.f_cpu=18432000L
attinyx41opti.menu.clock.184external.upload.speed=115200
attinyx41opti.menu.clock.20external=20 MHz (external - overclocked)
attinyx41opti.menu.clock.20external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.20external.build.f_cpu=20000000L
attinyx41opti.menu.clock.20external.upload.speed=115200
attinyx41opti.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx41opti.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attinyx41opti.menu.eesave.aenable=EEPROM retained
attinyx41opti.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx41opti.menu.eesave.disable=EEPROM not retained
attinyx41opti.menu.eesave.disable.bootloader.eesave_bit=1
attinyx41opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx41opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx41opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx41opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx41opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx41opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx41opti.menu.bodact.disabled=B.O.D. Disabled
attinyx41opti.menu.bodact.disabled.bootloader.bodact_bits=11
attinyx41opti.menu.bodact.enabled=B.O.D. Enabled
attinyx41opti.menu.bodact.enabled.bootloader.bodact_bits=10
attinyx41opti.menu.bodact.sampled=B.O.D. Sampled Mode
attinyx41opti.menu.bodact.sampled.bootloader.bodact_bits=01
attinyx41opti.menu.bodpd.disabled=B.O.D. Disabled
attinyx41opti.menu.bodpd.disabled.bootloader.bodpd_bits=11
attinyx41opti.menu.bodpd.enabled=B.O.D. Enabled
attinyx41opti.menu.bodpd.enabled.bootloader.bodpd_bits=10
attinyx41opti.menu.bodpd.sampled=B.O.D. Sampled Mode
attinyx41opti.menu.bodpd.sampled.bootloader.bodpd_bits=01
attinyx41opti.build.extra_flags={build.pinmap} {build.wiremode}
attinyx41opti.menu.pinmapping.anew=Clockwise (like Rev. D boards)
attinyx41opti.menu.pinmapping.anew.build.pinmap=-DNEW_PINOUT
attinyx41opti.menu.pinmapping.old=Counterclockwise (like old ATTinyCore and Rev. C boards)
attinyx41opti.menu.pinmapping.old.build.pinmap=-DOLD_PINOUT
attinyx41opti.menu.wiremode.amaster=Master Only
attinyx41opti.menu.wiremode.amaster.build.wiremode=-DWIRE_MASTER_ONLY
attinyx41opti.menu.wiremode.slave=Slave Only
attinyx41opti.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attinyx41opti.menu.wiremode.both=Both (uses more flash)
attinyx41opti.menu.wiremode.both.build.wiremode=-DWIRE_BOTH

