sleemanj/ATTinyCore/avr/boards.txt
attinyx313.name=ATtiny2313/4313
attinyx313.upload.maximum_size=4096
attinyx313.upload.maximum_data_size=256
attinyx313.upload.tool=avrdude
attinyx313.bootloader.tool=avrdude
attinyx313.bootloader.unlock_bits=0xFF
attinyx313.bootloader.lock_bits=0xFF
attinyx313.bootloader.file=empty/empty_all.hex
attinyx313.build.core=tiny
attinyx313.build.board=AVR_ATTINYX313
attinyx313.build.export_merged_output=false
attinyx313.bootloader.extended_fuses=0xFF
attinyx313.menu.LTO.enable=Enabled
attinyx313.menu.LTO.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attinyx313.menu.LTO.enable.ltoelfflags=-flto -DLTO_ENABLED -fuse-linker-plugin
attinyx313.menu.LTO.enable.ltocppflags=-flto -DLTO_ENABLED
attinyx313.menu.LTO.enable.ltoarcmd=gcc-
attinyx313.menu.LTO.disable=Disabled
attinyx313.menu.LTO.disable.ltocflags=
attinyx313.menu.LTO.disable.ltoelfflags=
attinyx313.menu.LTO.disable.ltocppflags=
attinyx313.menu.LTO.disable.ltoarcmd=
attinyx313.menu.chip.4313=ATtiny4313
attinyx313.menu.chip.4313.build.mcu=attiny4313
attinyx313.menu.chip.4313.upload.maximum_size=4096
attinyx313.menu.chip.4313.upload.maximum_data_size=256
attinyx313.menu.chip.2313=ATtiny2313
attinyx313.menu.chip.2313.build.mcu=attiny2313
attinyx313.menu.chip.2313.upload.maximum_size=2048
attinyx313.menu.chip.2313.upload.maximum_data_size=128
attinyx313.menu.clock.8internal=8 MHz (internal)
attinyx313.menu.clock.8internal.bootloader.low_fuses=0xE4
attinyx313.menu.clock.8internal.build.f_cpu=8000000L
attinyx313.menu.clock.20external=20 MHz (external)
attinyx313.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.20external.build.f_cpu=20000000L
attinyx313.menu.clock.16external=16 MHz (external)
attinyx313.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.16external.build.f_cpu=16000000L
attinyx313.menu.clock.12external=12 MHz (external)
attinyx313.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.12external.build.f_cpu=12000000L
attinyx313.menu.clock.8external=8 MHz (external)
attinyx313.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.8external.build.f_cpu=8000000L
attinyx313.menu.clock.1internal=1 MHz (internal)
attinyx313.menu.clock.1internal.bootloader.low_fuses=0x64
attinyx313.menu.clock.1internal.build.f_cpu=1000000L
attinyx313.menu.clock.4internal=4 MHz (internal)
attinyx313.menu.clock.4internal.bootloader.low_fuses=0xE2
attinyx313.menu.clock.4internal.build.f_cpu=4000000L
attinyx313.menu.clock.6external=6 MHz (external)
attinyx313.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx313.menu.clock.6external.build.f_cpu=6000000L
attinyx313.menu.clock.4external=4 MHz (external)
attinyx313.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx313.menu.clock.4external.build.f_cpu=4000000L
attinyx313.menu.clock.5internal=0.5 MHz (internal)
attinyx313.menu.clock.5internal.bootloader.low_fuses=0x62
attinyx313.menu.clock.5internal.build.f_cpu=500000L
attinyx313.menu.clock.737external=7.372 MHz (external)
attinyx313.menu.clock.737external.bootloader.low_fuses=0xFD
attinyx313.menu.clock.737external.build.f_cpu=7372800L
attinyx313.menu.clock.92external=9.216 MHz (external)
attinyx313.menu.clock.92external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.92external.build.f_cpu=9216000L
attinyx313.menu.clock.11external=11.0592 MHz (external)
attinyx313.menu.clock.11external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.11external.build.f_cpu=11059200L
attinyx313.menu.clock.14external=14.7456 MHz (external)
attinyx313.menu.clock.14external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.14external.build.f_cpu=14745600L
attinyx313.menu.clock.184external=18.432 MHz (external)
attinyx313.menu.clock.184external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.184external.build.f_cpu=18432000L
attinyx313.menu.clock.128internal=128 kHz (internal WDT)
attinyx313.menu.clock.128internal.bootloader.low_fuses=0xC5
attinyx313.menu.clock.128internal.build.f_cpu=128000L
attinyx313.bootloader.high_fuses=0b{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx313.menu.eesave.aenable=EEPROM retained
attinyx313.menu.eesave.aenable.bootloader.eesave_bit=1001
attinyx313.menu.eesave.disable=EEPROM not retained
attinyx313.menu.eesave.disable.bootloader.eesave_bit=1101
attinyx313.menu.bod.disable=B.O.D. Disabled
attinyx313.menu.bod.disable.bootloader.bod_bits=1111
attinyx313.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx313.menu.bod.1v8.bootloader.bod_bits=1101
attinyx313.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx313.menu.bod.2v7.bootloader.bod_bits=1011
attinyx313.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx313.menu.bod.4v3.bootloader.bod_bits=1001
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.0=no
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.1=yes
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.1.build.extra_flags=-DINITIALIZE_SECONDARY_TIMERS=1
attinyx313.build.variant=tinyX313








attiny5_diy.name=ATTiny5
attiny5_diy.upload.maximum_size=512
attiny5_diy.upload.maximum_data_size=32
attiny5_diy.upload.tool=avrdude_noefuse
attiny5_diy.bootloader.tool=avrdude_nobootloader_onefuse
attiny5_diy.bootloader.unlock_bits=0xFF
attiny5_diy.bootloader.lock_bits=0xFF
attiny5_diy.build.core=tiny
attiny5_diy.build.board=AVR_ATTINY5
attiny5_diy.menu.chip.5=ATtiny13
attiny5_diy.menu.chip.5.build.mcu=attiny5
attiny5_diy.menu.chip.5.upload.maximum_size=512
attiny5_diy.menu.chip.5.upload.maximum_data_size=32

attiny5_diy.menu.clock.8MHz=8MHz
attiny5_diy.menu.clock.8MHz.build.f_cpu=8000000L

attiny5_diy.menu.clock.4MHz=4MHz
attiny5_diy.menu.clock.4MHz.build.f_cpu=4000000L

attiny5_diy.menu.clock.2MHz=2MHz
attiny5_diy.menu.clock.2MHz.build.f_cpu=2000000L

attiny5_diy.menu.clock.1MHz=1MHz
attiny5_diy.menu.clock.1MHz.build.f_cpu=1000000L


attiny5_diy.build.variant=tiny5_10
attiny5_diy.build.extra_flags=-DNO_TONE


# Serial Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny5_diy.menu.serial.HalfDuplexRW=Half Duplex, Read+Write
attiny5_diy.menu.serial.HalfDuplexRW.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX

attiny5_diy.menu.serial.HalfDuplexRWStream=Half Duplex, Read+Write Inherits Stream
attiny5_diy.menu.serial.HalfDuplexRWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny5_diy.menu.serial.HalfDuplexRStream=Half Duplex, Read Only Inherits Stream
attiny5_diy.menu.serial.HalfDuplexRStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_WRITE -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny5_diy.menu.serial.HalfDuplexWStream=Half Duplex, Write Only Inherits Stream
attiny5_diy.menu.serial.HalfDuplexWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_READ

# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny5_diy.menu.print.default=Bin Only Supported (Smallest)
attiny5_diy.menu.print.default.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

attiny5_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny5_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

